Descriptor:
  Name: GetMembersAddedToaGroup
  DisplayName: Get Members Added To a Group - Entra ID
  Description: Looks for users added to a group in a given timeperiod.
SkillGroups:
  - Format: KQL
    Skills:
      - Name: GetMembersAddedToaGroup
        DisplayName: Get Members Added To a Group - Entra ID
        Description: Looks for users added to a group in a given timeperiod.
        Inputs:
          - Name: timeperiod
            Description: The timeperiod you want to run this query for. (e.g. 3d)
            Required: true
        Settings:
          Target: Sentinel
          TenantId: 316f06ca-066c-4a48-8790-57b76d684796
          SubscriptionId: b8f99f9f-c121-422b-a657-c999df2c5296
          ResourceGroupName: rg-jayesh
          WorkspaceName: PCS-Sentinel-Demo
          Template: |-
            let timeperiod = {{timeperiod}};
            AuditLogs
            | where TimeGenerated >= ago(timeperiod)
            | where ActivityDisplayName == "Add member to group"
            | extend GroupName = tostring(parse_json(tostring(parse_json(tostring(TargetResources[0].modifiedProperties))[1].newValue)))
            | extend TargetUser = tostring(TargetResources[0].userPrincipalName)
            | extend InitiatedBy_ = iff(isempty(tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)), tostring(parse_json(tostring(InitiatedBy.app)).displayName), tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName))
            | where isnotempty(TargetUser)
            | extend ipAddress_ = tostring(parse_json(tostring(InitiatedBy.user)).ipAddress)
            | summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), TotalUsersAdded = dcount(TargetUser), TargetUsers=make_set(TargetUser), InitiatedByUsers = make_set(TargetUser) by GroupName
