Descriptor:
  Name: GetOnboardedDevices - Defender
  DisplayName: GetOnboardedDevices - Defender
  Description: Skills to query Onboarded devices to Microsoft Defender for Endpoint

SkillGroups:
  - Format: KQL
    Skills:
      - Name: GetOnboardedDevices
        DisplayName: GetOnboardedDevices
        Description: Fetches the Devices which are Onboarded to the Microsoft Defender for Endpoint or EDR.
        Inputs:
          - Name: timeperiod
            Description: The start date for the query. (e.g. 3d)
            Required: true
        Settings:
          Target: Defender
          Template: |-
            let timeperiod = 7d;
            DeviceInfo
            | where Timestamp > ago(timeperiod)
            | where OnboardingStatus == "Onboarded"
            | summarize arg_max(Timestamp, *) by DeviceName
            | project Timestamp, DeviceName,PublicIP, OnboardingStatus, ExposureLevel, OSArchitecture, OSPlatform
