Descriptor:
  Name: Self Service Password Reset Users
  DisplayName: Self Service Password Reset Users - Entra ID
  Description: Looks for members reset the password by self-service in a given timeperiod.
SkillGroups:
  - Format: KQL
    Skills:
      - Name: Self Service Password Reset Users - Entra ID
        DisplayName: Self Service Password Reset Users - Entra ID
        Description: Looks for members reset the password by self-service in a given timeperiod.
        Inputs:
          - Name: timeperiod
            Description: The timeperiod you want to run this query for. (e.g. 3d)
            Required: true
        Settings:
          Target: Sentinel
          TenantId: 316f06ca-066c-4a48-8790-57b76d684796
          SubscriptionId: b8f99f9f-c121-422b-a657-c999df2c5296
          ResourceGroupName: rg-jayesh
          WorkspaceName: PCS-Sentinel-Demo
          Template: |-
            let timeperiod = {{timeperiod}};
            AuditLogs
            | where TimeGenerated > ago(timeperiod)
            | where LoggedByService == "Self-service Password Management" and OperationName == "Self-service password reset flow activity progress"
            | extend userPrincipalName_ = tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)
            | summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), TotalCount = count() by UPN = userPrincipalName_, Result
