Descriptor:
  Name: Self Service Password Reset Users
  DisplayName: Self Service Password Reset Users - Entra ID
  Description: Looks for members reset the password by self-service in a given timeperiod.
SkillGroups:
  - Format: KQL
    Skills:
      - Name: Self Service Password Reset Users - Entra ID
        DisplayName: Self Service Password Reset Users - Entra ID
        Description: Looks for members reset the password by self-service in a given timeperiod.
        Inputs:
          - Name: timeperiod
            Description: The timeperiod you want to run this query for. (e.g. 3d)
            Required: true
        Settings:
          Target: Sentinel
          TenantId: 76d6f49a-7a26-4433-818f-55a47ae85a0c
          SubscriptionId: 3affbdc3-38f2-4efb-a0bb-0ac9280ba152
          ResourceGroupName: sentinel-soc
          WorkspaceName: PCS-MSSP-Sentinel
          Template: |-
            let timeperiod = {{timeperiod}};
            AuditLogs
            | where TimeGenerated > ago(timeperiod)
            | where LoggedByService == "Self-service Password Management" and OperationName == "Self-service password reset flow activity progress"
            | extend userPrincipalName_ = tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)
            | summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), TotalCount = count() by UPN = userPrincipalName_, Result
