Descriptor:
  Name: SCUChanges
  DisplayName: SCU Changes
  Description: Looks for SCU changes in the last 3 days

SkillGroups:
  - Format: KQL
    Skills:
      - Name: SCUChanges
        DisplayName: SCU Changes
        Description: Looks for SCU changes in the last 3 days
        Settings:
          Target: Sentinel
          TenantId: 76d6f49a-7a26-4433-818f-55a47ae85a0c
          SubscriptionId: 3affbdc3-38f2-4efb-a0bb-0ac9280ba152
          ResourceGroupName: sentinel-soc
          WorkspaceName: PCS-MSSP-Sentinel
          Template: |-
            AzureActivity | where TimeGenerated >= ago(3d) | where ResourceProviderValue == "MICROSOFT.SECURITYCOPILOT" | extend resourceName = tostring(parse_json(Properties).resource) | extend resourceGroupName = tostring(parse_json(Properties).resourceGroup) | extend resourceActivity = tostring(parse_json(Properties).message) | where resourceActivity == "Microsoft.SecurityCopilot/capacities/write"| distinct Caller, CallerIpAddress, resourceName, resourceGroupName, resourceActivity
